Revit 2027 API
TemporaryViewModes.IsValidState Method
 Tests whether the given state is valid for the associated view and the context the view is currently in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidState(
	PreviewFamilyVisibilityMode state
)
Public Function IsValidState (
	state As PreviewFamilyVisibilityMode
) As Boolean
public:
bool IsValidState(
	PreviewFamilyVisibilityMode state
)
member IsValidState :
        state : PreviewFamilyVisibilityMode -> bool
Parameters
state PreviewFamilyVisibilityMode
 A state of the PreviewFamilyVisibilityMode
Return Value
Boolean
 Returns True if the state is applicable for the view; False otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 As long as the PreviewFamilyVisibility mode is available and enabled in the associated view, the Off and On states are always valid. However, the Uncut state is only valid in plan views and reflected ceilings.
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace